user/tutorials/Nike/TML_reacting/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    front
    {
        type            empty;
        inGroups        1(empty);
        nFaces          131072;
        startFace       260992;
    }
    back
    {
        type            empty;
        inGroups        1(empty);
        nFaces          131072;
        startFace       392064;
    }
    left
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          1024;
        startFace       523136;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  right;
    }
    right
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          1024;
        startFace       524160;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  left;
    }
    bottom
    {
        type            patch;
        nFaces          128;
        startFace       525184;
    }
    top
    {
        type            patch;
        nFaces          128;
        startFace       525312;
    }
)

// ************************************************************************* //
