user/tutorials/Nike/TML_reacting/constant/chem
elements        
3
(
H
O
C
)
;


species        6(C12H26 O2 CO2 CO H2O N2);


reactions
{
}

Tlow            200;
Thigh           6000;

